<?php

namespace Database\Seeders;

use App\Models\Group;
use Illuminate\Database\Seeder;

class ArabicSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $questions = [
            [
                "groupId" => Group::where("type", "المعيار كتابة الحروف الهجائية كاملة بأشكالها المختلفة من الذاكرة البعيدة")->first(),
                "text" => "قم بتوصيل الحرف إلى الكلمات الموجود فيها",
                [
                    "word" => "م",
                    "options" => ["مـشعل", "عـمـر", "علـم", "أقالم", "نحـن", "فـرحة"],
                    "answer" => ["مـشعل", "عـمـر", "علـم", "أقالم"],
                    "type" => "توصيل",
                    "mark" => 10
                ],
                [
                    "word" => "ب",
                    "options" => ["بـلادي", "مكتـبـة", "كتـب", "حاسوب", "نـافـذة", "قفـص"],
                    "answer" => ["بـلادي", "مكتـبـة", "كتـب", "حاسوب"],
                    "type" => "توصيل",
                    "mark" => 10
                ],
                [
                    "word" => "د",
                    "options" => ["دفتر", "جريـدة", "أسـد", "ورد", "نـافـذة", "قفـص"],
                    "answer" => ["دفتر", "جريـدة", "أسـد", "ورد"],
                    "type" => "توصيل",
                    "mark" => 10
                ],
                [
                    "word" => "ت",
                    "options" => ["تـمر", "بيـتـنا", "لعبـت", "توت", "صـقر", "قفـص"],
                    "answer" => ["تـمر", "بيـتـنا", "لعبـت", "توت"],
                    "type" => "توصيل",
                    "mark" => 10
                ],
                [
                    "word" => "س",
                    "options" => ["سـور", "نـسـر", "تكنـس", "حارس", "صـقر", "بيـتـنا"],
                    "answer" => ["سـور", "نـسـر", "تكنـس", "حارس"],
                    "type" => "توصيل",
                    "mark" => 10
                ],
                [
                    "word" => "ح",
                    "options" => ["حـمل", "لـحـق", "مسبـح", "فرح", "صـقر", "بيـتـنا"],
                    "answer" => ["حـمل", "لـحـق", "مسبـح", "فرح"],
                    "type" => "توصيل",
                    "mark" => 10
                ],
                [
                    "word" => "ك",
                    "options" => ["كـرة", "يبـكـي", "أمسـك", "أعدك", "غـزال", "بيـتـنا"],
                    "answer" => ["كـرة", "يبـكـي", "أمسـك", "أعدك"],
                    "type" => "توصيل",
                    "mark" => 10
                ],
                [
                    "word" => "ع",
                    "options" => ["عـمر", "سـعـيد", "واسـع", "أسبوع", "غـزال", "بيـتـنا"],
                    "answer" => ["عـمر", "سـعـيد", "واسـع", "أسبوع"],
                    "type" => "توصيل",
                    "mark" => 10
                ],
                [
                    "word" => "ظ",
                    "options" => ["ظـالم", "مـظـلة", "يحافـظ", "محفوظ", "كـثـير", "بـخـور"],
                    "answer" => ["عـمر", "سـعـيد", "واسـع", "أسبوع"],
                    "type" => "توصيل",
                    "mark" => 10
                ],
                [
                    "word" => "ي",
                    "options" => ["يـحب", "تـيـن", "كرسـي", "النادي", "هـواء", "بـخـور"],
                    "answer" => ["يـحب", "تـيـن", "كرسـي", "النادي"],
                    "type" => "توصيل",
                    "mark" => 10
                ],
            ],//حرف
            [
                "groupId" => Group::where("type", "المعيار اكتشاف دالالت الكلمات الجديدة من خلال الترادف والتضاد")->first(),
                "text" => "قم بتوصيل الكلمة إلى مرادفها",
                [
                    "word" => "المقدَسة",
                    "options" => ["الواسعة", "المطهرة"],
                    "answer" => "المطهرة",
                    "type" => "توصيل",
                    "mark" => 10
                ],
                [
                    "word" => "ْقدَوة",
                    "options" => ["ِمثال", "ُمَساَعَدة"],
                    "answer" => "ِمثال",
                    "type" => "توصيل",
                    "mark" => 10
                ],
                [
                    "word" => "ُ أْسِعف",
                    "options" => ["ُ أَعاِلج", "أَسابق"],
                    "answer" => "أَعاِلج",
                    "type" => "توصيل",
                    "mark" => 10
                ],
                [
                    "word" => "ُيتزحزح",
                    "options" => ["ُيثبت", "يتحرك"],
                    "answer" => "يتحرك",
                    "type" => "توصيل",
                    "mark" => 10
                ],
                [
                    "word" => "يبذرني",
                    "options" => ["يزرعني", "يحصدني"],
                    "answer" => "يزرعني",
                    "type" => "توصيل",
                    "mark" => 10
                ],

            ],//ترادف
            [
                "groupId" => Group::where("type", "المعيار اكتشاف دالالت الكلمات الجديدة من خلال الترادف والتضاد")->first(),
                "text" => "قم بتوصيل الكلمة إلى بضدها",
                [
                    "word" => "توفي",
                    "options" => ["وُلِد", "كبر"],
                    "answer" => "وُلِد",
                    "type" => "توصيل",
                    "mark" => 10
                ],
                [
                    "word" => "َ يْنُمو",
                    "options" => ["يَكْبر", "يتوقف"],
                    "answer" => "يَكْبر",
                    "type" => "توصيل",
                    "mark" => 10
                ],
                [
                    "word" => "َفكرةٌ رائعةٌ",
                    "options" => ["فكرةٌ جيدةٌ", "فكرةٌ قبيحةٌ"],
                    "answer" => "فكرةٌ قبيحةٌ",
                    "type" => "توصيل",
                    "mark" => 10
                ],
                [
                    "word" => "َتتجول",
                    "options" => ["تتمشى", "تتوقف"],
                    "answer" => "تتوقف",
                    "type" => "توصيل",
                    "mark" => 10
                ],
                [
                    "word" => "الحديثة",
                    "options" => ["القديمة", "الجديدة"],
                    "answer" => "القديمة",
                    "type" => "توصيل",
                    "mark" => 10
                ],
            ],//تضاد
            ["groupId" => Group::where("type", "معيار / ترتيب كلمات لبناء جملة مفيدة")->first(),
                "text" => "قم ترتيب الكلمات إلى جملة مفيدة",
                [
                    "words" => ["المكرمة", "في", "المسجد", "مكة", "الحرام,"],
                    "answer" => "المسجد الحرام في مكة المكرمة",
                    "type" => "ترتيب",
                    "mark" => 10],
                [
                    "words" => ["البر", "الصدق", "إلى", "يهدي"],
                    "answer" => "الصدق يهدي إلى البر",
                    "type" => "ترتيب",
                    "mark" => 10
                ],
                [
                    "words" => ["عن", "الأذى", "الطريق", "صدقة", "إماطة"],
                    "answer" => "إماطة الأذى عن الطريق صدقة",
                    "type" => "ترتيب",
                    "mark" => 10
                ],
                [
                    "words" => ["عن", "غابت", "المدرسة", "وفاء"],
                    "answer" => "غابت وفاء عن المدرسة",
                    "type" => "ترتيب",
                    "mark" => 10
                ],
                [
                    "words" => ["الجد", "طاعة", "واجبة"],
                    "answer" => "طاعة الجد واجبة",
                    "type" => "ترتيب",
                    "mark" => 10
                ],
            ],//ترتيب
            [
                "groupId" => Group::where("type", "المعيار/تحليل الجمل إلى كلمات والكلمات إلى مقاطع والمقاطع إلى أصوات")->first(),
                "text" => "قم بتحليل الجمل إلى كلمات ",
                [
                    "sentence" => "ابتعد الخروف عن القطيع",
                    "answer" => ["ابتعد", "الخروف", "عن", "القطيع"],
                    "type" => "تحليل",
                    "mark" => 10
                ],
                [
                    "sentence" => "شاَهد الغراب الصغير نسرا",
                    "answer" => ["شاَهد", "الغراب", "الصغير", "نسرا"],
                    "type" => "تحليل",
                    "mark" => 10
                ],
                [
                    "sentence" => "زارت المعلمة أم أحلام",
                    "answer" => ["زارت", "المعلمة", "أم", "أحلام"],
                    "type" => "تحليل",
                    "mark" => 10
                ],
            ], //تحليل جمل
            [
                "groupId" => Group::where("type", "المعيار/تحليل الجمل إلى كلمات والكلمات إلى مقاطع والمقاطع إلى أصوات")->first(),
                "text" => "أحلل الكلمات إلى مقاطع : ",
                [
                    "sentence" => "َجِديَدة",
                    "answer" => ["جِـ", "َديـ", "د" . "ة"],
                    "type" => "تحليل",
                    "mark" => 10
                ],
                [
                    "sentence" => "مَتْجَرٌ",
                    "answer" => ["مَتْـ", "جـ", "ٌَر"],
                    "type" => "تحليل",
                    "mark" => 10
                ],
                [
                    "sentence" => "صندوق",
                    "answer" => ["صنـ", "دو", "ق"],
                    "type" => "تحليل",
                    "mark" => 10
                ],
            ],//تحليل كلمات
            [
                "groupId" => Group::where("type", "المعيار/تحليل الجمل إلى كلمات والكلمات إلى مقاطع والمقاطع إلى أصوات")->first(),
                "text" => "أحلل المقاطع إلى أصوات : ",
                [
                    "sentence" => "َيْلَـ",
                    "answer" => ["يـْ","لـَ"],
                    "type" => "تحليل",
                    "mark" => 10
                ],
                [
                    "sentence" => "هُو",
                    "answer" => ["هـُ", "و"],
                    "type" => "تحليل",
                    "mark" => 10
                ],
                [
                    "sentence" => "تِمْـ",
                    "answer" => ["تـِ", "مـ"],
                    "type" => "تحليل",
                    "mark" => 10
                ],
                [
                    "sentence" => "غِيـ",
                    "answer" => ["غـِ", "يـ"],
                    "type" => "تحليل",
                    "mark" => 10
                ],
            ],//تحليل المقاطع
            [
                "groupId" => Group::where("type", "المعيار/ قراءة كلمات والنصوص")->first(),
                "text" => "أقرأ الجمل التالية ",
                "sentence" => " عَادَ عُمَرُ مِنَ الْمَدْرَسَةِ سَعِيداً.
                 قَالَ عُمَرُ : الْيَوْمَ بَدَأَ أُسْبُوعُ الْمُرورِ . تَعَلَّمْتُ قَوَاعِدَ السَّلامَةِ عِنْدَ الْعُبُورِ ",
                "type" => "قراءة",
                "mark" => 10
            ],
        ];


    }
}
