<?php

namespace Database\Seeders;

use App\Models\Group;
use Illuminate\Database\Seeder;

class MathSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $questions = [
            //Group 1
            [
                // الطالب يبعث رقم الأشكال
                'groupId' => Group::where('title', 'قراءة وكتابة الأعداد ضمن العدد 20'),
                'type' => 'عرض أشكال و إدخال',
                'text' => "أعد الأشكال التالية",
                "answer" => 5,
                "mark" => 10
            ],
            [
                // الطالب يبعث رقم الأشكال
                'groupId' => Group::where('title', 'قراءة وكتابة الأعداد ضمن العدد 20'),
                'type' => 'عرض أشكال و إدخال',
                'text' => "أعد الأشكال التالية",
                "answer" => 13,
                "mark" => 10
            ],
            [
                // الطالب يبعث رقم الأشكال
                'groupId' => Group::where('title', 'قراءة وكتابة الأعداد ضمن العدد 20'),
                'type' => 'عرض أشكال وإدخال',
                'text' => "أعد الأشكال التالية",
                "answer" => 17,
                "mark" => 10
            ],
            [
                // الطالب يبعث رقم الأشكال
                'groupId' => Group::where('title', 'قراءة وكتابة الأعداد ضمن العدد 20'),
                'type' => 'عرض أشكال وإدخال',
                'text' => "أعد الأشكال التالية",
                "answer" => 8,
                "mark" => 10
            ],
            [
                // الطالب يبعث رقم الأشكال
                'groupId' => Group::where('title', 'قراءة وكتابة الأعداد ضمن العدد 20'),
                'type' => 'عرض أشكال وإدخال',
                'text' => "أعد الأشكال التالية",
                "answer" => 3,
                "mark" => 10
            ],
            [
                // الطالب يكتب الرقم من الكيبورد
                'groupId' => Group::where('title', 'قراءة وكتابة الأعداد ضمن العدد 20'),
                'type' => 'ادخال',
                'text' => "ادخل العدد عشرون",
                "answer" => 20,
                "mark" => 10
            ],
            [
                // الطالب يكتب الرقم من الكيبورد
                'groupId' => Group::where('title', 'قراءة وكتابة الأعداد ضمن العدد 20'),
                'type' => 'ادخال',
                'text' => "ادخل العدد أحد عشر",
                "answer" => 11,
                "mark" => 10
            ],
            [
                // الطالب يكتب الرقم من الكيبورد
                'groupId' => Group::where('title', 'قراءة وكتابة الأعداد ضمن العدد 20'),
                'type' => 'ادخال',
                'text' => "ادخل العدد سبعة",
                "answer" => 7,
                "mark" => 10
            ],
            [
                // الطالب يسجل صوت وهو عم يعد
                // التصحيح من قبل الخبير
                'groupId' => Group::where('title', 'قراءة وكتابة الأعداد ضمن العدد 20'),
                'type' => 'عرض أشكال وصوت',
                'text' => "أعد الأشكال التالية",
                "answer" => 20,
                "mark" => 10
            ],
            [
                // الطالب يسجل صوت وهو عم يعد
                // التصحيح من قبل الخبير
                'groupId' => Group::where('title', 'قراءة وكتابة الأعداد ضمن العدد 20'),
                'type' => 'عرض أشكال وصوت',
                'text' => "أعد الأشكال التالية",
                "answer" => 13,
                "mark" => 10
            ],

            //group 2
            [
                'groupId' => Group::where('title', 'تميز الأعداد ضمن العدد 20'),
                'type' => 'اختر الإجابة',
                'text' => "ضع دائرة حول العدد الأكبر في كل مجموعة",
                "answer" => 10,
                "mark" => 10,
                "options" => [4, 5, 6, 10, 2]
            ],
            [
                'groupId' => Group::where('title', 'تميز الأعداد ضمن العدد 20'),
                'type' => 'اختر الإجابة',
                'text' => "ضع دائرة حول العدد الأكبر في كل مجموعة",
                "answer" => 20,
                "mark" => 25,
                "options" => [15, 19, 17, 11, 20]
            ],
            [
                'groupId' => Group::where('title', 'تميز الأعداد ضمن العدد 20'),
                'type' => 'اختر الإجابة',
                'text' => "اختر الأعداد المتشابهة",
                "answer" => [2, 2, 2, 2, 2, 2],
                "mark" => 25,
                "options" => [1, 8, 5, 2, 2, 2, 6, 2, 4, 7, 2, 3, 2]
            ],
            [
                'groupId' => Group::where('title', 'تميز الأعداد ضمن العدد 20'),
                'type' => 'اختر الإجابة',
                'text' => "اختر الأعداد المتشابهة",
                "answer" => [17, 17, 17, 17, 17],
                "mark" => 25,
                "options" => [17, 13, 11, 14, 17, 17, 19, 16, 12, 17, 20, 17, 15]
            ],

            //Group 3
            [
                'groupId' => Group::where('title', 'مقارنة الأعداد ضمن العدد 20'),
                'type' => ' (عرض مجموعات من الأشكال) اختر الإجابة',
                'text' => "اختر الأجابة الصحيحة",
                "answer" => 6,
                "mark" => 20,
                "options" => [5, 6]
            ],
            [
                'groupId' => Group::where('title', 'مقارنة الأعداد ضمن العدد 20'),
                'type' => ' (عرض مجموعات من الأشكال) اختر الإجابة',
                'text' => "اختر الأجابة الصحيحة",
                "answer" => 9,
                "mark" => 20,
                "options" => [9, 8]
            ],
            [
                'groupId' => Group::where('title', 'مقارنة الأعداد ضمن العدد 20'),
                'type' => ' (عرض مجموعات من الأشكال) اختر الإجابة',
                'text' => "اختر الأجابة الصحيحة",
                "answer" => [10, 10],
                "mark" => 20,
                "options" => [10, 10]
            ],
            [
                'groupId' => Group::where('title', 'مقارنة الأعداد ضمن العدد 20'),
                'type' => ' (عرض مجموعات من الأشكال) اختر الإجابة',
                'text' => "اختر الأجابة الصحيحة",
                "answer" => [7, 7],
                "mark" => 20,
                "options" => [7, 7]
            ],
            [
                'groupId' => Group::where('title', 'مقارنة الأعداد ضمن العدد 20'),
                'type' => ' (عرض مجموعات من الأشكال) اختر الإجابة',
                'text' => "اختر الأجابة الصحيحة",
                "answer" => [13, 9],
                "mark" => 20,
                "options" => 13
            ],

            //

        ];
    }
}
