<?php

namespace Database\Seeders;

use App\Models\Group;
use Illuminate\Database\Seeder;

class MathSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $questions = [
            //Group 1
            [
                // الطالب يبعث رقم الأشكال
                'groupId' => Group::where('title', 'قراءة وكتابة الأعداد ضمن العدد 20'),
                'typeَQuestion' => 'عرض أشكال و إدخال',
                'text' => "أعد الأشكال التالية",
                "answer" => 5,
                "mark" => 10
            ],
            [
                // الطالب يبعث رقم الأشكال
                'groupId' => Group::where('title', 'قراءة وكتابة الأعداد ضمن العدد 20'),
                'type' => 'عرض أشكال و إدخال',
                'text' => "أعد الأشكال التالية",
                "answer" => 13,
                "mark" => 10
            ],
            [
                // الطالب يبعث رقم الأشكال
                'groupId' => Group::where('title', 'قراءة وكتابة الأعداد ضمن العدد 20'),
                'type' => 'عرض أشكال وإدخال',
                'text' => "أعد الأشكال التالية",
                "answer" => 17,
                "mark" => 10
            ],
            [
                // الطالب يبعث رقم الأشكال
                'groupId' => Group::where('title', 'قراءة وكتابة الأعداد ضمن العدد 20'),
                'type' => 'عرض أشكال وإدخال',
                'text' => "أعد الأشكال التالية",
                "answer" => 8,
                "mark" => 10
            ],
            [
                // الطالب يبعث رقم الأشكال
                'groupId' => Group::where('title', 'قراءة وكتابة الأعداد ضمن العدد 20'),
                'type' => 'عرض أشكال وإدخال',
                'text' => "أعد الأشكال التالية",
                "answer" => 3,
                "mark" => 10
            ],
            [
                // الطالب يكتب الرقم من الكيبورد
                'groupId' => Group::where('title', 'قراءة وكتابة الأعداد ضمن العدد 20'),
                'type' => 'ادخال',
                'text' => "ادخل العدد عشرون",
                "answer" => 20,
                "mark" => 10
            ],
            [
                // الطالب يكتب الرقم من الكيبورد
                'groupId' => Group::where('title', 'قراءة وكتابة الأعداد ضمن العدد 20'),
                'type' => 'ادخال',
                'text' => "ادخل العدد أحد عشر",
                "answer" => 11,
                "mark" => 10
            ],
            [
                // الطالب يكتب الرقم من الكيبورد
                'groupId' => Group::where('title', 'قراءة وكتابة الأعداد ضمن العدد 20'),
                'type' => 'ادخال',
                'text' => "ادخل العدد سبعة",
                "answer" => 7,
                "mark" => 10
            ],
            [
                // الطالب يسجل صوت وهو عم يعد
                // التصحيح من قبل الخبير
                'groupId' => Group::where('title', 'قراءة وكتابة الأعداد ضمن العدد 20'),
                'type' => 'عرض أشكال وصوت',
                'text' => "أعد الأشكال التالية",
                "answer" => 20,
                "mark" => 10
            ],
            [
                // الطالب يسجل صوت وهو عم يعد
                // التصحيح من قبل الخبير
                'groupId' => Group::where('title', 'قراءة وكتابة الأعداد ضمن العدد 20'),
                'type' => 'عرض أشكال وصوت',
                'text' => "أعد الأشكال التالية",
                "answer" => 13,
                "mark" => 10
            ],

            //group 2
            [
                'groupId' => Group::where('title', 'تميز الأعداد ضمن العدد 20'),
                'type' => 'اختر الإجابة',
                'text' => "ضع دائرة حول العدد الأكبر في كل مجموعة",
                "answer" => 10,
                "mark" => 10,
                "options" => [4, 5, 6, 10, 2]
            ],
            [
                'groupId' => Group::where('title', 'تميز الأعداد ضمن العدد 20'),
                'type' => 'اختر الإجابة',
                'text' => "ضع دائرة حول العدد الأكبر في كل مجموعة",
                "answer" => 20,
                "mark" => 25,
                "options" => [15, 19, 17, 11, 20]
            ],
            [
                'groupId' => Group::where('title', 'تميز الأعداد ضمن العدد 20'),
                'type' => 'اختر الإجابة',
                'text' => "اختر الأعداد المتشابهة",
                "answer" => [2, 2, 2, 2, 2, 2],
                "mark" => 25,
                "options" => [1, 8, 5, 2, 2, 2, 6, 2, 4, 7, 2, 3, 2]
            ],
            [
                'groupId' => Group::where('title', 'تميز الأعداد ضمن العدد 20'),
                'type' => 'اختر الإجابة',
                'text' => "اختر الأعداد المتشابهة",
                "answer" => [17, 17, 17, 17, 17],
                "mark" => 25,
                "options" => [17, 13, 11, 14, 17, 17, 19, 16, 12, 17, 20, 17, 15]
            ],

            //Group 3
            [
                'groupId' => Group::where('title', 'مقارنة الأعداد ضمن العدد 20'),
                'type' => ' (عرض مجموعات من الأشكال) اختر الإجابة',
                'text' => "اختر الأجابة الصحيحة",
                "answer" => 6,
                "mark" => 20,
                "options" => [5, 6]
            ],
            [
                'groupId' => Group::where('title', 'مقارنة الأعداد ضمن العدد 20'),
                'type' => ' (عرض مجموعات من الأشكال) اختر الإجابة',
                'text' => "اختر الأجابة الصحيحة",
                "answer" => 9,
                "mark" => 20,
                "options" => [9, 8]
            ],
            [
                'groupId' => Group::where('title', 'مقارنة الأعداد ضمن العدد 20'),
                'type' => ' (عرض مجموعات من الأشكال) اختر الإجابة',
                'text' => "اختر الأجابة الصحيحة",
                "answer" => [10, 10],
                "mark" => 20,
                "options" => [10, 10]
            ],
            [
                'groupId' => Group::where('title', 'مقارنة الأعداد ضمن العدد 20'),
                'type' => ' (عرض مجموعات من الأشكال) اختر الإجابة',
                'text' => "اختر الأجابة الصحيحة",
                "answer" => [7, 7],
                "mark" => 20,
                "options" => [7, 7]
            ],
            [
                'groupId' => Group::where('title', 'مقارنة الأعداد ضمن العدد 20'),
                'type' => ' (عرض مجموعات من الأشكال) اختر الإجابة',
                'text' => "اختر الأجابة الصحيحة",
                "answer" => 13,
                "mark" => 20,
                "options" => [13, 9]
            ],
            //group 4
            [
                'groupId' => Group::where('title', 'ترتيب الأعداد'),
                'type' => "عرض على مستقيم الأعداد و إدخال",
                'text' => "أكمل الأعداد على خط الأعداد",
                "mark" => 20,
                "options" => [12, "x", "x", 15, "x", "x"],
                "answer" => [12, 13, 14, 15, 16, 17],
            ],
            [
                'groupId' => Group::where('title', 'ترتيب الأعداد'),
                'type' => "عرض على مستقيم الأعداد و إدخال",
                'text' => "أكمل الأعداد على خط الأعداد",
                "mark" => 20,
                "options" => ["x", 5, 6, "x", "x", "x"],
                "answer" => [4, 5, 6, 7, 8, 9],
            ],
            [
                'groupId' => Group::where('title', 'ترتيب الأعداد'),
                'type' => "ترتيب أعداد",
                'text' => "رتب الأعداد التالية",
                "mark" => 20,
                "options" => [44, 4, 14, 41],
                "answer" => [4, 14, 41, 44],
            ],
            [
                'groupId' => Group::where('title', 'ترتيب الأعداد'),
                'type' => "ترتيب أعداد",
                'text' => "رتب الأعداد التالية",
                "mark" => 20,
                "options" => [60, 11, 23, 60, 19, 70,],
                "answer" => [11, 19, 23, 30, 60, 70],
            ],
            [
                'groupId' => Group::where('title', 'ترتيب الأعداد'),
                'type' => "ترتيب أعداد",
                'text' => "رتب الأعداد التالية",
                "mark" => 20,
                "options" => [100, 4, 23, 57, 16, 37, 73, 96, 90, 83],
                "answer" => [4, 16, 23, 37, 57, 73, 83, 90, 96, 100],
            ],

            //Group 5
            [
                'groupId' => Group::where('title', 'عد الأعداد من 1-100'),
                'type' => "عرض الأعداد (تسجيل صوتي)",
                'text' => "عد الأعداد التالية",
                "mark" => 100,
                "answer" => 100
            ],
            //Group 6
            [
                'groupId' => Group::where('title', 'جمع الأعداد'),
                'type' => "عرض عملية جمع الأعداد (إدخال)",
                'text' => "أجمع ما يلي",
                "mark" => 10,
                "answer" => 9,
                'options' => [4, 5]
            ],
            [
                'groupId' => Group::where('title', 'جمع الأعداد'),
                'type' => "عرض عملية جمع الأعداد (إدخال)",
                'text' => "أجمع ما يلي",
                "mark" => 10,
                "answer" => 12,
                'options' => [8, 4]
            ],
            [
                'groupId' => Group::where('title', 'جمع الأعداد'),
                'type' => "عرض عملية جمع الأعداد (إدخال)",
                'text' => "أجمع ما يلي",
                "mark" => 10,
                "answer" => 11,
                'options' => [2, 9]
            ],
            [
                'groupId' => Group::where('title', 'جمع الأعداد'),
                'type' => "عرض عملية جمع الأعداد (إدخال)",
                'text' => "أجمع ما يلي",
                "mark" => 10,
                "answer" => 22,
                'options' => [17, 5]
            ],
            [
                'groupId' => Group::where('title', 'جمع الأعداد'),
                'type' => "عرض عملية جمع الأعداد (إدخال)",
                'text' => "أجمع ما يلي",
                "mark" => 10,
                "answer" => 7,
                'options' => [7, 0]
            ],
            [
                'groupId' => Group::where('title', 'جمع الأعداد'),
                'type' => "عرض عملية جمع الأعداد (إدخال)",
                'text' => "أجمع ما يلي",
                "mark" => 10,
                "answer" => 41,
                'options' => [20, 11]
            ],
            [
                'groupId' => Group::where('title', 'جمع الأعداد'),
                'type' => "عرض عملية جمع الأعداد (إدخال)",
                'text' => "أجمع ما يلي",
                "mark" => 10,
                "answer" => 100,
                'options' => [70, 30]
            ],
            [
                'groupId' => Group::where('title', 'جمع الأعداد'),
                'type' => "عرض عملية جمع الأعداد (إدخال)",
                'text' => "أجمع ما يلي",
                "mark" => 10,
                "answer" => 77,
                'options' => [11, 66]
            ],
            [
                'groupId' => Group::where('title', 'جمع الأعداد'),
                'type' => "عرض عملية جمع الأعداد (إدخال)",
                'text' => "أجمع ما يلي",
                "mark" => 10,
                "answer" => 65,
                'options' => [20, 45]
            ],
            [
                'groupId' => Group::where('title', 'جمع الأعداد'),
                'type' => "عرض عملية جمع الأعداد (إدخال)",
                'text' => "اجمع ما يلي",
                "mark" => 10,
                "answer" => 30,
                'options' => [23, 7]
            ],

            //Group 7
            [
                'groupId' => Group::where('title', 'طرح الأعداد'),
                'type' => "عرض عملية طرح الأعداد (إدخال)",
                'text' => "اطرح ما يلي",
                "mark" => 10,
                "answer" => 4,
                'options' => [13, 9]
            ],
            [
                'groupId' => Group::where('title', 'طرح الأعداد'),
                'type' => "عرض عملية طرح الأعداد (إدخال)",
                'text' => "اطرح ما يلي",
                "mark" => 10,
                "answer" => 12,
                'options' => [44, 32]
            ],
            [
                'groupId' => Group::where('title', 'طرح الأعداد'),
                'type' => "عرض عملية طرح الأعداد (إدخال)",
                'text' => "اطرح ما يلي",
                "mark" => 10,
                "answer" => 3,
                'options' => [10, 7]
            ],
            [
                'groupId' => Group::where('title', 'طرح الأعداد'),
                'type' => "عرض عملية طرح الأعداد (إدخال)",
                'text' => "اطرح ما يلي",
                "mark" => 10,
                "answer" => 0,
                'options' => [7, 7]
            ],
            [
                'groupId' => Group::where('title', 'طرح الأعداد'),
                'type' => "عرض عملية طرح الأعداد (إدخال)",
                'text' => "اطرح ما يلي",
                "mark" => 10,
                "answer" => 10,
                'options' => [17, 7]
            ],
            [
                'groupId' => Group::where('title', 'طرح الأعداد'),
                'type' => "عرض عملية طرح الأعداد (إدخال)",
                'text' => "اطرح ما يلي",
                "mark" => 10,
                "answer" => 3,
                'options' => [20, 17]
            ],
            [
                'groupId' => Group::where('title', 'طرح الأعداد'),
                'type' => "عرض عملية طرح الأعداد (إدخال)",
                'text' => "اطرح ما يلي",
                "mark" => 10,
                "answer" => 25,
                'options' => [50, 25]
            ],
            [
                'groupId' => Group::where('title', 'طرح الأعداد'),
                'type' => "عرض عملية طرح الأعداد (إدخال)",
                'text' => "اطرح ما يلي",
                "mark" => 10,
                "answer" => 11,
                'options' => [30, 19]
            ],
            [
                'groupId' => Group::where('title', 'طرح الأعداد'),
                'type' => "عرض عملية طرح الأعداد (إدخال)",
                'text' => "اطرح ما يلي",
                "mark" => 10,
                "answer" => 20,
                'options' => [33, 13]
            ],
            [
                'groupId' => Group::where('title', 'طرح الأعداد'),
                'type' => "عرض عملية طرح الأعداد (إدخال)",
                'text' => "اطرح ما يلي",
                "mark" => 10,
                "answer" => 6,
                'options' => [6, 0]
            ],


        ];
    }
}
